# -*- coding: utf-8 -*-
"""
Created on Thu Mar 30 17:10:42 2023

@author: bruno
"""


from pyecharts import options as opts
from pyecharts.charts import Map

GDP_list = [('香港特别行政区',45540),('澳门特别行政区',41984),('台湾省',32449),
            ('北京市',28245),('上海市',26657),('江苏省',21467),('福建省',18848),
            ('浙江省',17657),('天津市',17652),('广东省',15126),
            ('内蒙古自治区',14338),('湖北省',13695),('重庆市',13475),
            ('山东省',12775),('陕西省',12316),('安徽省',10949),('山西省',10949),
            ('湖南省',10921),('江西省',10551),('宁夏回族自治区',10390),
            ('新疆维吾尔自治区',10182),('辽宁省',10181),('四川省',10072),
            ('海南省',9932),('河南省',9223),('云南省',9173),('青海省',9031),
            ('西藏自治区',8658),('河北省',8453),('吉林省',8177),('贵州省',7778),
            ('广西壮族自治区',7759),('黑龙江省',7561),('甘肃省',6684)]

c = (
    Map()
        .add("2022年人均GDP（美元）", 
         data_pair=GDP_list, 
         maptype="china",
         is_map_symbol_show=False,
    )
        .set_global_opts(
            title_opts=opts.TitleOpts(
                title="2022年中国一级行政区人均GDP（美元）"
                ),
        visualmap_opts=opts.VisualMapOpts(min_=6000, max_=46000,
                                          is_piecewise=False),
    )
)

c.render('./2022中国一级行政区人均GDP_map.html')